export default {
    /* 移动电话 */
    mobile: `^1[3|4|5|6|7|8|9]\\d{9}$`,
    /* 固定电话^(\(\d{3,4}-)|\d{3.4}-)?\d{7,8}$ */
    phone: `^0([1-9]\\d{1,2}\\-{0,1}\\d{7,8})$`,
    /* 邮政编码 */
    postcode: `^\\d{6}$`,
    /* 邮箱 */
    email: `^[\\u4e00-\\u9fa5\\w]+([-+.][\\u4e00-\\u9fa5\\w]+)*@\\w+([-.]\\w+)*\\.\\w+([-.]\\w+)*$`,
    /* 邮寄地址 */
    address: `[\\w\\u4E00-\\u9FA5]+`,
    /* 用户名 */
    userName: `^[A-Za-z][A-Za-z0-9]{1,20}$`,
    /* 密码 */
    // passWord: `^(?![\\d]+$)(?![a-zA-Z]+$)[\\da-zA-Z]{8,20}$`,
    passWord: `^[A-Za-z0-9]{1,20}$`,
    /* qq */
    qq: `^[1-9]\\d{4,9}$`,
    /* 传真 */
    fax: `^(\\d{3,4}-)?\\d{7,8}$`,
    /* 名称 */
    // name: `^[\\w\\u4E00-\\u9FA5]{1,20}$`,
    name: `^[\\w]{1,20}$`,
    nameAll: `^[\\w\\u4E00-\\u9FA5]{1,20}$`,
    /* 编码 */
    code: `^[\\w]{1,20}$`,
    /* 短信验证码 */
    verificationCode: `^[A-Za-z0-9]{6,8}$`,
    /* 经纬度 */
    lglt: `^[1-9]\\d{0,2}[.]\\d{1,8}$`
};
